<template>
  <section class="pt- lg-8 pt-xl-9">
    <b-container class="pt-4 pt-lg-0">
      <b-row>
        <b-col xl="8" class="mx-auto">
          <div class="text-center mb-6">
            <h1>شرایط و ضوابط</h1>
            <p class="lead mb-0">آخرین به‌روزرسانی در تیر ۱۴۰۳</p>
          </div>

          <h6 class="mb-3">مقدمه</h6>
          <p>
            به میزل خوش آمدید. این شرایط و ضوابط استفاده شما از وب‌سایت ما را تنظیم می‌کند. لطفاً آنها را با دقت بخوانید. با دسترسی و استفاده از وب‌سایت ما، شما موافقت می‌کنید که به این شرایط پایبند باشید.
          </p>

          <p>
            اگر با این شرایط موافق نیستید، لطفاً از وب‌سایت ما استفاده نکنید. شرایط و ضوابط ما قوانین و دستورالعمل‌های استفاده از وب‌سایت، حقوق مالکیت معنوی، محتوای تولید شده توسط کاربر و موارد دیگر را شرح می‌دهد.
          </p>

          <p>
            اگر سوال یا نگرانی‌ای در مورد این شرایط دارید، لطفاً با ما تماس بگیرید.
استفاده شما از وب‌سایت ما نیز تحت سیاست حفظ حریم خصوصی ما است.
ما ممکن است این شرایط و ضوابط را در هر زمانی به‌روزرسانی کنیم، بنابراین لطفاً به‌صورت دوره‌ای برای تغییرات آن‌ها را مرور کنید. از بازدید شما از میزل سپاسگزاریم.
          </p>

          <h6 class="mb-3 mt-5">پذیرش شرایط</h6>
          <p>
            با دسترسی یا استفاده از این وب‌سایت، شما موافقت می‌کنید که به این شرایط و ضوابط پایبند باشید. اگر با این شرایط موافق نیستید، لطفاً از این وب‌سایت استفاده نکنید.
          </p>

          <h6 class="mb-3 mt-5">مالکیت معنوی</h6>
          <p>
            تمام محتوا در این وب‌سایت، از جمله متن، تصاویر، گرافیک‌ها و لوگوها، متعلق به میزل است و تحت قوانین مالکیت معنوی محافظت می‌شود.
          </p>
          <p>
            شما نمی‌توانید از هیچ محتوایی از این وب‌سایت بدون دریافت رضایت کتبی قبلی از میزل استفاده، تولید مجدد یا توزیع کنید.
          </p>
          <ul class="list-group list-group-borderless">
            <li class="list-group-item heading-color icons-center mb-0">
              <span><BIconArrowRight class="me-2 rtl:-scale-x-100" /> </span> دریافت اعلان‌های فوری در میزل
              هر زمان که به‌روزرسانی یا اقدامی در اسلک انجام شود
            </li>
            <li class="list-group-item heading-color icons-center mb-0">
              <span><BIconArrowRight class="me-2 rtl:-scale-x-100" /> </span> به‌طور آسان وظایف را در هر دو پلتفرم ایجاد، اختصاص و مدیریت کنید، اطمینان حاصل کنید که هیچ چیزی از دست نرود.
            </li>
            <li class="list-group-item heading-color d-flex mb-0">
              <span><BIconArrowRight class="me-2 mt-1 rtl:-scale-x-100" /> </span> همه داده‌های خود را منسجم و به‌روز نگه‌دارید، چه اطلاعات مشتری، جزئیات پروژه، یا پیام‌های مهم باشد.
            </li>
          </ul>

          <h6 class="mb-3 mt-5">محدودیت مسئولیت</h6>
          <p>
            میزل هیچ تضمین یا نمایندگی درباره دقت یا کامل بودن محتوای این وب‌سایت نمی‌دهد.
          </p>

          <p>
            میزل مسئول هیچ‌گونه خسارت مستقیم، غیرمستقیم، تبعی، یا تصادفی ناشی از استفاده شما از این وب‌سایت نمی‌باشد.
          </p>
        </b-col>
      </b-row>
    </b-container>
  </section>
</template>

<script setup lang="ts">
import { BIconArrowRight } from 'bootstrap-icons-vue'
</script>
