import avatar2Img from '@/assets/images/avatar/02.jpg'
import avatar3Img from '@/assets/images/avatar/03.jpg'
import avatar4Img from '@/assets/images/avatar/04.jpg'
import avatar5Img from '@/assets/images/avatar/05.jpg'
import avatar6Img from '@/assets/images/avatar/06.jpg'
import type { FAQType } from '@/types'

export const faqData: FAQType[] = [
  {
    question: 'چند آیتم در این لیست وجود دارد؟',
    answer:
      'خنده‌ها و شادی‌ها برگردانده شد و وزن بیشتری پیدا کرد. خوشبختانه سرهنگ خوشحال شد که ما به بالاترین سطح حمله کردیم. قانون را امتحان کردیم اما سبک کودک. خستگی از حقیقت که هیچ‌چیز معامله نمی‌شود. نقاشی‌ها رنجیده‌اند اما پاسخ‌های جنیگز شش خندید و دور شد. اتاق‌ها به‌طور کامل توسط بدتر گرفته شد. امتیازها ترسناک است اما ممکن است قانون به پایان برسد.'
  },
  {
    question: 'آیا می‌توانید میزل را در یک جمله توصیف کنید؟',
    answer:
      'سپتامبر چگونه مردان به‌طور قابل قبول دو رفتار را ترتیب دادند. او دفاتر برای بالاترین رتبه‌ها و یکی را پاسخ داد که مرتع تلاش کرد. کشف در روزنامه به هیچ وجه تحسین نشد. پیوسته تمایل مالکیت حل و فصل در یا ظاهر بی‌تأثیر من. درگیر بود که شوهر راضی مشهود بود. آری، خوشبختی صلاحیت انجام دادن هیچ مسکن. اول ام شوخی‌های صفحه شروع شد تا علت مقیاس شود. موضوعات او پیش‌بینی شکوه دنبال نکرد هیچ بر آن پیروز نشد. بهبود داده‌های خود برکت ممکن است خاص خانگی. چشم‌انداز خانه هرگز رابطه ندارد. نه بازدید کرده بالا بردن گرانش خارجی موضوع کلبه من آقای باشد.'
  },
  {
    question: 'آژانس‌ها چه خدماتی ارائه می‌دهند؟',
    answer:
      'آژانس‌ها با توجه به تخصص خود طیف گسترده‌ای از خدمات را ارائه می‌دهند. برخی از خدمات رایج شامل کمپین‌های تبلیغاتی، بازاریابی دیجیتال، برندینگ، طراحی خلاقانه، برنامه‌ریزی و خرید رسانه، روابط عمومی، مدیریت استعداد، برنامه‌ریزی رویداد و تحقیقات بازار است.'
  },
  {
    question: 'چگونه آژانس مناسب برای نیازهای خود را انتخاب کنم؟',
    answer: `When selecting an agency, consider your specific requirements, budget, and the agency's expertise and track record in your industry. پژوهش their portfolio, client testimonials, and case studies to gauge their capabilities. It's also important to meet with the agency to assess their communication style and ensure they align with your goals.`
  },
  {
    question: 'مزایای استخدام یک آژانس چیست؟',
    answer:
      'استخدام یک آژانس مزایای متعددی از جمله دسترسی به مهارت‌ها و تخصص‌های ویژه، بینش‌های صنعتی، تفکر خلاقانه، شبکه‌های برقرار شده و منابع را به همراه دارد. آژانس‌ها می‌توانند دیدگاه‌های تازه‌ای ارائه دهند، زمان و تلاش را صرفه‌جویی کنند و به شما کمک کنند تا اهداف خود را مؤثرتر به دست آورید.'
  },
  {
    question: 'آژانس چقدر طول می‌کشد تا نتایج را ارائه دهد؟',
    answer:
      'زمان لازم برای دستیابی به نتایج به ماهیت پروژه و پیچیدگی آن بستگی دارد. کمپین‌های کوتاه‌مدت ممکن است نتایج را در عرض چند هفته به ارمغان آورند، در حالی که استراتژی‌های بلندمدت ممکن است چندین ماه یا حتی سال‌ها طول بکشد تا تأثیر قابل توجهی داشته باشد. همکاری مؤثر، اهداف روشن و انتظارات واقع‌بینانه می‌تواند به تسریع فرآیند کمک کند.'
  },
  {
    question: 'چگونه می‌توانم موفقیت کمپین‌ها یا خدمات آژانس را اندازه‌گیری کنم؟',
    answer:
      'شاخص‌های موفقیت بستگی به اهداف و مقاصد پروژه شما دارد. شاخص‌های رایج شامل افزایش فروش یا درآمد، بهبود شناخت برند، رشد ترافیک وب‌سایت، تعامل در رسانه‌های اجتماعی، تولید سرنخ، جذب مشتری یا پوشش مثبت رسانه‌ای است. با آژانس همکاری کنید تا شاخص‌های کلیدی عملکرد (KPIs) را تعریف کرده و مکانیزم‌های اندازه‌گیری را ایجاد کنید.'
  },
  {
    question: `آیا می‌توانم قرارداد خود را با آژانس در صورت عدم رضایت فسخ کنم؟`,
    answer: `بله، اگر از آژانس راضی نیستید، می‌توانید قرارداد خود را فسخ کنید، هرچند که شرایط خاص فسخ باید در قرارداد مشخص شده باشد. توصیه می‌شود که ابتدا هرگونه نگرانی یا مشکل را با آژانس مطرح کنید تا ببینید آیا می‌توانند آنها را حل کنند. اگر رابطه قابل بازیابی نیست، ممکن است لازم باشد مراحل فسخ توافق‌شده را دنبال کنید.`
  }
]

export const actionData: string[] = [avatar6Img, avatar5Img, avatar2Img, avatar3Img, avatar4Img]
