import avatar11 from '@/assets/images/avatar/11.jpg'
import avatar8 from '@/assets/images/avatar/08.jpg'
import avatar5 from '@/assets/images/avatar/05.jpg'
import type { PricingPlanType, ServiceType } from '@/types'

export const approach: string[] = [
  "به مخاطبان جهانی دست یابید و حضور برند خود را گسترش دهید.",
  'پیگیری در زمان واقعی و تصمیم‌گیری مبتنی بر داده‌ها',
  'تعامل بهبود یافته با مشتریان',
  'افزایش تبدیل‌ها و افزایش درآمد',
  'ایجاد یک جامعه مشتری وفادار',
  'حفاظت از داده‌ها و حریم خصوصی مشتریان'
]

type WorkType = {
  id: number
} & ServiceType

export type PricingType = {
  avatar: string
} & PricingPlanType

export const work: WorkType[] = [
  {
    id: 1,
    title: 'درک اهداف مشتریان',
    description:
      'فرآیند با مشاوره کامل با مشتری برای درک اهداف تجاری آن‌ها آغاز می‌شود.'
  },
  {
    id: 2,
    title: 'تحقیقات بازار',
    description: `آن‌ها همچنین حضور آنلاین فعلی و تلاش‌های بازاریابی مشتری را تحلیل می‌کنند.`
  },
  {
    id: 3,
    title: 'بهینه‌سازی موتور جستجو (SEO)',
    description: `برای بهبود دید، استراتژی‌های SEO به کار می‌روند تا رتبه‌بندی موتور جستجوی وب‌سایت مشتری را بهبود بخشند.`
  },
  {
    id: 4,
    title: 'سازگاری با تغییرات صنعت',
    description: `آژانس‌های بازاریابی دیجیتال با روندهای صنعت و تغییرات الگوریتم به‌روز می‌مانند.`
  }
]

export const pricing: PricingType[] = [
  {
    avatar: avatar11,
    description:
      'من به شدت میزل را به هر کسی که به دنبال یک قالب بوت‌استرپ با کیفیت بالا است، توصیه می‌کنم. دره به سوی بیست به طور مستقیم به من هدایت کرد. برای حل مشکلات صبحانه، به طور کامل یا به درستی.',
    title: 'اما واتسون'
  },
  {
    avatar: avatar8,
    description:
      'دو نفر قبل از آنکه به تنگنا بیفتند، به جز لحظه‌ای از خودشان به کمک دیگران وابسته نشدند. ناامیدی و اطمینان همسر راه را روشن کردند و در نهایت هیچ راهی برای جبران باقی نماند.',
    title: 'لوئیس فرگوسن'
  },
  {
    avatar: avatar5,
    description:
      "تعهد ما به برتری در خدمات مشتری یکی از دلایل اصلی است که ما در صدر بازار قرار داریم. ما همیشه به سختی تلاش کرده‌ایم تا بهترین تجربه را برای مشتریان خود فراهم کنیم.",
    title: 'ژاکلین میلر'
  }
]
