import {
  bellIcon,
  fileIcon,
  locationIcon,
  messageIcon,
  peopleIcon,
  rocketIcon
} from '@/assets/data/icons'
import type { BSIconType, CounterType, FeatureType, ServiceType } from '@/types'
import { BIconBoxes, BIconDiagram3, BIconPeople, BIconShieldCheck } from 'bootstrap-icons-vue'

type FeaturesType = {
  title1: string
  icon1: BSIconType
  description1: string
} & FeatureType

export const featureContent: FeatureType[] = [
  {
    title: 'توضیح ارزش طراحی',
    description:
      "این چینش دقیق عناصر است که نه تنها جذابیت بصری را افزایش می‌دهد بلکه عملکرد، کارایی و تجربه کاربری را نیز بهبود می‌بخشد. طراحی موثر هویت برند شما را منتقل می‌کند، اعتماد را ایجاد می‌کند و می‌تواند تأثیر قابل توجهی بر نرخ تبدیل و وفاداری مشتری داشته باشد."
  },
  {
    title: 'منابعی برای دسترسی به رنگ‌ها کشف کنید',
    description:
      'ما مجموعه‌ای از ابزارها، راهنماها و بهترین شیوه‌ها را ارائه می‌دهیم تا به شما کمک کنیم طراحی‌ها، وبسایت‌ها و محتوایی را ایجاد کنید که شامل و قابل دسترس برای همه افراد، بدون توجه به توانایی‌های بصری آنها باشد.'
  },
  {
    title: 'بررسی کنتراست رابط کاربری برای استانداردهای دسترسی',
    description:
      'این فرآیند مهم اطمینان می‌دهد که محتوا به راحتی توسط افرادی با درجات مختلفی از اختلالات بینایی خوانا و قابل درک باشد. با رعایت استانداردهای دسترسی، شما تجربه‌ای جامع‌تر و کاربرپسندتر برای همه کاربران ایجاد می‌کنید، بدون توجه به توانایی‌های بصری آنها، و به یک محیط دیجیتال دسترس‌پذیرتر کمک می‌کنید.'
  },
  {
    title: 'بررسی دسترسی‌پذیری در مرورگرها',
    description:
      'با ارزیابی نحوه عملکرد محتوای دیجیتال و ویژگی‌های شما در مرورگرهای مختلف، می‌توانید مشکلات احتمالی دسترسی را شناسایی کرده و تنظیمات لازم را انجام دهید تا تجربه آنلاین روان و دسترس‌پذیری را برای کاربران فراهم کنید، بدون توجه به انتخاب مرورگر آنها.'
  }
]

export const counterData: CounterType[] = [
  {
    title: 'مدیریت پروژه در یک روز',
    state: 150,
    suffix: '+'
  },
  {
    title: 'صرفه‌جویی در زمان برای مشتری ما',
    state: 120,
    suffix: '+'
  },
  {
    title: 'نظرات مثبت کاربران',
    state: 10,
    suffix: 'میلیون+'
  },
  {
    title: 'مشتریان خوشحال',
    state: 600,
    suffix: '+'
  }
]

export const features: FeaturesType[] = [
  {
    icon: BIconDiagram3,
    title: 'داده‌های خود را سازماندهی کنید',
    description: 'ما سرور ابری خوبی داریم',
    icon1: BIconBoxes,
    title1: 'تحلیل‌های جاسازی شده',
    description1: 'یک‌بار پرداخت برای استفاده همیشگی'
  },
  {
    icon: BIconPeople,
    title: 'با هر تیمی کار کنید',
    description: 'آماده برای کمک به کارمند شما',
    icon1: BIconShieldCheck,
    title1: 'همکاری امن',
    description1: 'به اشتراک بگذارید و رکورد خود را منتشر کنید.'
  }
]

export const feature: FeatureType[] = [
  {
    title: 'وظایف و نقش‌ها',
    description:
      'مالکان را به گفتگوها اختصاص دهید و به اعضای تیم وظیفه دهید تا هر به‌روزرسانی را دنبال کنند.',
    icon: peopleIcon
  },
  {
    title: 'پیام‌های داخلی',
    description:
      'پیشنهادی سریع شش یا هفت ارائه دهید و در میان دوستان جذاب ملاقات کنید، بحث با آقایان در زمینه مسکن و مواد زندگی',
    icon: messageIcon
  },
  {
    title: 'پیش‌نمایش فایل‌ها',
    description:
      'بسیار پیشرفته به نظر می‌رسد که شوخی‌ها تمام شده‌اند. بیشتر از شجاعت سرهنگ من ارائه داده شد.',
    icon: fileIcon
  },
  {
    title: 'پیوست‌های بزرگ',
    description:
      'همه چیز را با بی‌احتیاطی در برابر خود قرار می‌دهد. رابطه جنسی که خواسته بود برای شام طول کشید و واقعاً آرزو داشت که یاغی شود.',
    icon: rocketIcon
  },
  {
    title: 'یادآوری‌ها',
    description:
      'چنین کمکی به شما اگر در داخل درب بود. خنده پیشنهاد خنده‌دار برای هر پسری که در نظر گرفته می‌شود.',
    icon: bellIcon
  },
  {
    title: 'ردیابی مکان',
    description:
      'فکر کنید که پایان کار است. او پیر و محبوب خود رسید و او را در حالی که هنوز پر صدا بود، ثابت کرد.',
    icon: locationIcon
  }
]
