import client1 from '@/assets/images/client/logo-tailwise.svg'
import client2 from '@/assets/images/client/logo-listkit.svg'
import client3 from '@/assets/images/client/logo-nephos.svg'
import client4 from '@/assets/images/client/logo-vulk.svg'
import client5 from '@/assets/images/client/logo-ideko.svg'
import client6 from '@/assets/images/client/logo-mizzle.svg'
import avatar6 from '@/assets/images/avatar/06.jpg'
import avatar5 from '@/assets/images/avatar/05.jpg'
import avatar2 from '@/assets/images/avatar/02.jpg'
import avatar3 from '@/assets/images/avatar/03.jpg'
import avatar4 from '@/assets/images/avatar/04.jpg'
import decoration10 from '@/assets/images/elements/saas-decoration/10.png'
import decoration11 from '@/assets/images/elements/saas-decoration/11.png'
import decoration12 from '@/assets/images/elements/saas-decoration/12.png'
import type { FAQType, ServiceType } from '@/types'

type FeaturedType = {
  odd?: boolean
  lg?: number
  cols?: number
  variant?: string
  span?: string
} & ServiceType

export const swiper: string[] = [client5, client4, client1, client2, client3, client6]

export const features: FeaturedType[] = [
  {
    title: 'تقسیم‌بندی داده‌های جامع',
    description:
      'به‌طور عمیق به داده‌های خود نگاه کنید. قابلیت‌های تقسیم‌بندی جامع ما را بررسی کنید تا بتوانید زیرمجموعه‌های خاصی از داده‌های خود را برای دریافت بینش‌های دقیق تحلیل کنید.',
    image: decoration10,
    odd: false
  },
  {
    title: 'سفارشی‌سازی متناسب با نیازهای شما',
    description:
      'تجربه تحلیل داده‌های خود را به‌طور سفارشی تنظیم کنید. کشف کنید که چگونه ابزار ما می‌تواند برای برآورده کردن نیازهای گزارش‌گیری و تحلیل منحصر به فرد شما سفارشی شود.',
    image: decoration11,
    odd: true
  },
  {
    title: 'همکاری در داده‌ها آسان شد',
    description:
      'به‌طور هماهنگ با تیم خود همکاری کنید. ابزار ما به اشتراک‌گذاری داده‌ها، نظردهی و گزارش‌گیری مشترک را تسهیل می‌کند تا بتوانید به‌طور مؤثر همکاری کنید.',
    image: decoration12,
    odd: false
  }
]

export const avatars: string[] = [avatar6, avatar5, avatar2, avatar3, avatar4]

export const faq: FAQType[] = [
  {
    question: 'چند آیتم در این لیست وجود دارد؟',
    answer:
      'خنده‌ها و شادی‌ها برگردانده شد و وزن بیشتری پیدا کرد. خوشبختانه سرهنگ خوشحال شد که ما به بالاترین سطح حمله کردیم. قانون را امتحان کردیم اما سبک کودک. خستگی از حقیقت که هیچ‌چیز معامله نمی‌شود. نقاشی‌ها رنجیده‌اند اما پاسخ‌های جنیگز شش خندید و دور شد. اتاق‌ها به‌طور کامل توسط بدتر گرفته شد. امتیازها ترسناک است اما ممکن است قانون به پایان برسد.'
  },
  {
    question: 'آیا می‌توانید میزل را در یک جمله توصیف کنید؟',
    answer:
      'سپتامبر چگونه مردان به‌طور قابل قبول دو رفتار را ترتیب دادند. او دفاتر برای بالاترین رتبه‌ها و یکی را پاسخ داد که مرتع تلاش کرد. کشف در روزنامه به هیچ وجه تحسین نشد. سوالات پیوسته تمایل مالکیت حل و فصل در یا ظاهر بی‌تأثیر من. درگیر بود که شوهر راضی مشهود بود. آری، خوشبختی صلاحیت انجام دادن هیچ مسکن. اول ام شوخی‌های صفحه شروع شد تا علت مقیاس شود. موضوعات او پیش‌بینی شکوه دنبال نکرد هیچ بر آن پیروز نشد. بهبود داده‌های خود برکت ممکن است خاص خانگی. چشم‌انداز خانه هرگز رابطه ندارد. نه بازدید کرده بالا بردن گرانش خارجی موضوع کلبه من آقای باشد.'
  },
  {
    question: 'آیا می‌توانم از این تم برای مشتری خود استفاده کنم؟',
    answer:
      'چگونه مردان به‌طور قابل قبول دو رفتار را ترتیب دادند. او دفاتر برای بالاترین رتبه‌ها و یکی را پاسخ داد که مرتع تلاش کرد. کشف در روزنامه به هیچ وجه تحسین نشد. سوالات پیوسته تمایل مالکیت حل و فصل در یا ظاهر بی‌تأثیر من. درگیر بود که شوهر راضی مشهود بود. آری، خوشبختی صلاحیت انجام دادن هیچ مسکن. اول ام شوخی‌های صفحه شروع شد تا علت مقیاس شود. موضوعات او پیش‌بینی شکوه دنبال نکرد هیچ بر آن پیروز نشد. بهبود داده‌های خود برکت ممکن است خاص خانگی. چشم‌انداز خانه هرگز رابطه ندارد. نه بازدید کرده بالا بردن گرانش خارجی موضوع کلبه من آقای باشد. نگه داشتن انجام در پارک پاره در نزدیکی پای خود به پرونده من. دعوت به فهمیده شد احساست گهگاهی بی‌مزه سکونت در. افسوس تغییر اصول قدیمی. آیا به سرعت مهربانی درست است. احترام مقاله کلبه رنگ شده او دفاتر سالن‌ها است.'
  },
  {
    question: 'آیا تم‌هایی در دسته‌بندی‌های دیگر ارائه می‌دهید؟',
    answer:
      'اما او آماده‌ترین حداقل مجموعه‌ای زندگی کرد علی‌رغم صلب. سپتامبر چگونه مردان به‌طور قابل قبول دو رفتار ترتیب دادند. او دفاتر برای بالاترین رتبه‌ها و یکی را پاسخ داد که مرتع تلاش کرد. کشف در روزنامه به هیچ وجه تحسین نشد. پیوسته تمایل مالکیت حل و فصل در یا ظاهر بی‌تأثیر من. درگیر بود که شوهر راضی مشهود بود. آری، خوشبختی صلاحیت انجام دادن هیچ مسکن. اول ام شوخی‌های صفحه شروع شد تا علت مقیاس شود. موضوعات او پیش‌بینی شکوه دنبال نکرد هیچ بر آن پیروز نشد. بهبود داده‌های خود برکت ممکن است خاص خانگی. چشم‌انداز خانه هرگز رابطه ندارد. نه بازدید کرده بالا بردن گرانش خارجی موضوع کلبه من آقای باشد.'
  },
  {
    question: 'آیا نیاز است که وقتی از این تم استفاده می‌کنم، به شما اعتبار دهم؟',
    answer:
      'اما او آماده‌ترین حداقل مجموعه‌ای زندگی کرد علی‌رغم صلب. سپتامبر چگونه مردان به‌طور قابل قبول دو رفتار ترتیب دادند. او دفاتر برای بالاترین رتبه‌ها و یکی را پاسخ داد که مرتع تلاش کرد. کشف در روزنامه به هیچ وجه تحسین نشد. پیوسته تمایل مالکیت حل و فصل در یا ظاهر بی‌تأثیر من. درگیر بود که شوهر راضی مشهود بود. آری، خوشبختی صلاحیت انجام دادن هیچ مسکن. اول ام شوخی‌های صفحه شروع شد تا علت مقیاس شود. موضوعات او پیش‌بینی شکوه دنبال نکرد هیچ بر آن پیروز نشد. بهبود داده‌های خود برکت ممکن است خاص خانگی. چشم‌انداز خانه هرگز رابطه ندارد. نه بازدید کرده بالا بردن گرانش خارجی موضوع کلبه من آقای باشد.'
  }
]

export const finalFeature: FeaturedType[] = [
  {
    lg: 6,
    variant: 'dark',
    title: 'ویژگی',
    description: 'کسب‌وکار خود را با ابزارهای مناسب به ارتفاعات بی‌سابقه‌ای برسانید.',
    span: '42%'
  },
  {
    lg: 6,
    variant: 'success',
    title: 'تحلیل داده‌ها',
    description: 'کسب‌وکار خود را با ابزارهای مناسب به ارتفاعات جدیدی ارتقا دهید.',
    span: '5X'
  },
  {
    cols: 12,
    variant: 'danger',
    title: 'درآمد',
    description:
      'پتانسیل کامل کسب‌وکار خود را آزاد کنید و با بهره‌برداری از قدرت ابزارها و فناوری‌های پیشرفته موجود امروز، به ارتفاعات جدیدی دست یابید.',
    span: '2.3M',
    type: 'money'
  }
]
