import type { FAQType, ServiceType } from '@/types'
import {
  BIconAppIndicator,
  BIconBoxes,
  BIconCashCoin,
  BIconEmojiSmile,
  BIconEnvelopeOpen,
  BIconHeadset,
  BIconHouse,
  BIconLayers,
  BIconTicketPerforated
} from 'bootstrap-icons-vue'

export type HelpType = {
  content: string[]
} & ServiceType

export const helpData: HelpType[] = [
  {
    icon: BIconBoxes,
    title: 'شروع کنید',
    content: [
      'Gulp و سفارشی‌سازی',
      'تنظیمات رنگ و لوگو',
      'حالت تاریک، نسخه RTL و بارگذاری تنبل',
      'به‌روزرسانی‌ها و پشتیبانی'
    ]
  },
  {
    icon: BIconEmojiSmile,
    title: 'راه‌اندازی حساب',
    content: [
      'اتصال به حساب شما',
      'ویرایش اطلاعات پروفایل خود',
      'افزودن عکس پروفایل خود',
      'توصیف فروشگاه شما'
    ]
  },
  {
    icon: BIconLayers,
    title: 'موضوعات دیگر',
    content: [
      'امنیت و حریم خصوصی',
      'راهنماهای نویسنده، ناشر و مدیر',
      'طرح‌های قیمت‌گذاری',
      'مالیات بر فروش و هزینه‌های نظارتی'
    ]
  },
  {
    icon: BIconHouse,
    title: 'استفاده پیشرفته',
    content: ['مدیریت و صورت‌حساب', 'تبدیل شدن به یک حرفه‌ای', 'برنامه موبایل', 'راهنما']
  },
  {
    icon: BIconCashCoin,
    title: 'صورتحساب و پرداخت‌ها',
    content: [
      'چگونه می‌توانم بازپرداخت بگیرم؟',
      'چگونه رسید دریافت کنم؟',
      'طرح‌های قیمت‌گذاری',
      'مالیات بر فروش و هزینه‌های نظارتی'
    ]
  },
  {
    icon: BIconAppIndicator,
    title: 'یکپارچگی',
    content: [
      'بررسی قابلیت‌های ادغام',
      'راه‌اندازی ادغام‌ها',
      'چقدر پشتیبانی نرم‌افزاری؟'
    ]
  }
]

export const faqData: FAQType[] = [
  {
    question: 'چگونه می‌توانیم کمک کنیم؟',
    answer:
      'اما به‌طور شگفت‌آوری ظاهر او پیش‌بینی‌اش را دریافت می‌کند. تلاش‌های منحرف شده در بستر مردان خاصی را که خواستار نیستند. تیزبینی مهارت‌ها را به‌طور مؤدبانه در امور جنسی فراهم می‌آورد. ضمانت پانزده به اشتباه افشا شده است. شرم از آن‌جا در شلوغی دوباره ساخته شد. به عنوان جوانان امیدوار نیست که مکان‌های او وسایل را داشته باشد. تمایل کاهش یافته شاد اما درخواست‌های تحسین. در ذکر شاید تلاش‌های تیز فرضی. ناشناخته شما اتاق ضمانت نورلند رسید.'
  },
  {
    question: 'چگونه پروفایل خود را ویرایش کنم؟',
    answer:
      'چه معامله شیطانی اجاره به واقع در. اما او آماده‌ترین حداقل مجموعه‌ای زندگی کرد علی‌رغم صلب. سپتامبر چگونه مردان به‌طور قابل قبول دو رفتار ترتیب دادند. او دفاتر برای بالاترین رتبه‌ها و یکی را پاسخ داد که مرتع تلاش کرد. کشف در روزنامه به هیچ وجه تحسین نشد. پیوسته تمایل مالکیت حل و فصل در یا ظاهر بی‌تأثیر من. درگیر بود که شوهر راضی مشهود بود. آری، خوشبختی صلاحیت انجام دادن هیچ مسکن. اول ام شوخی‌های صفحه شروع شد تا علت مقیاس شود. موضوعات او پیش‌بینی شکوه دنبال نکرد هیچ بر آن پیروز نشد. بهبود داده‌های خود برکت ممکن است خاص خانگی. چشم‌انداز خانه هرگز رابطه ندارد. نه بازدید کرده بالا بردن گرانش خارجی موضوع کلبه من آقای باشد.'
  },
  {
    question: 'چقدر باید به فروشندگان پیشنهاد دهم؟',
    answer:
      'پست نه آنچه معامله شیطانی اجاره به واقع در. اما او آماده‌ترین حداقل مجموعه‌ای زندگی کرد علی‌رغم صلب. سپتامبر چگونه مردان به‌طور قابل قبول دو رفتار ترتیب دادند. او دفاتر برای بالاترین رتبه‌ها و یکی را پاسخ داد که مرتع تلاش کرد. کشف در روزنامه به هیچ وجه تحسین نشد. پیوسته تمایل مالکیت حل و فصل در یا ظاهر بی‌تأثیر من. درگیر بود که شوهر راضی مشهود بود. آری، خوشبختی صلاحیت انجام دادن هیچ مسکن. اول ام شوخی‌های صفحه شروع شد تا علت مقیاس شود. موضوعات او پیش‌بینی شکوه دنبال نکرد هیچ بر آن پیروز نشد. بهبود داده‌های خود برکت ممکن است خاص خانگی. چشم‌انداز خانه هرگز رابطه ندارد. نه بازدید کرده بالا بردن گرانش خارجی موضوع کلبه من آقای باشد. نگه داشتن انجام در پارک پاره در نزدیکی پای خود به پرونده من. دعوت به فهمیده شد احساست گهگاهی بی‌مزه سکونت در. افسوس تغییر اصول قدیمی. آیا به سرعت مهربانی درست است. احترام مقاله کلبه رنگ شده او دفاتر سالن‌ها است.'
  },
  {
    question: 'راهنمای نصب',
    answer: `"چه معامله شیطانی اجاره به واقع در. اما او آماده‌ترین حداقل مجموعه‌ای زندگی کرد علی‌رغم صلب. سپتامبر چگونه مردان به‌طور قابل قبول دو رفتار ترتیب دادند. او دفاتر برای بالاترین رتبه‌ها و یکی را پاسخ داد که مرتع تلاش کرد. کشف در روزنامه به هیچ وجه تحسین نشد. پیوسته تمایل مالکیت حل و فصل در یا ظاهر بی‌تأثیر من. درگیر بود که شوهر راضی مشهود بود. آری، خوشبختی صلاحیت انجام دادن هیچ مسکن. اول ام شوخی‌های صفحه شروع شد تا علت مقیاس شود. موضوعات او پیش‌بینی شکوه دنبال نکرد هیچ بر آن پیروز نشد. بهبود داده‌های خود برکت ممکن است خاص خانگی. چشم‌انداز خانه هرگز رابطه ندارد. نه بازدید کرده بالا بردن گرانش خارجی موضوع کلبه من آقای باشد."
                     "در حال حاضر، ما تنها کارت‌های اعتباری/دبیت و پرداخت‌های پی‌پال را قبول می‌کنیم. پی‌پال ساده‌ترین راه برای انجام پرداخت‌ها آنلاین است. در حین بررسی سفارش خود، مطمئن شوید که جزئیات صحیح را برای پردازش سریع و بدون دردسر پرداخت وارد کنید."`
  },
  {
    question: 'گزینه‌ها و خدمات اضافی',
    answer:
      'پست نه آنچه معامله شیطانی اجاره به واقع در. اما او آماده‌ترین حداقل مجموعه‌ای زندگی کرد علی‌رغم صلب. سپتامبر چگونه مردان به‌طور قابل قبول دو رفتار ترتیب دادند. او دفاتر برای بالاترین رتبه‌ها و یکی را پاسخ داد که مرتع تلاش کرد. کشف در روزنامه به هیچ وجه تحسین نشد. پیوسته تمایل مالکیت حل و فصل در یا ظاهر بی‌تأثیر من. درگیر بود که شوهر راضی مشهود بود. آری، خوشبختی صلاحیت انجام دادن هیچ مسکن. اول ام شوخی‌های صفحه شروع شد تا علت مقیاس شود. موضوعات او پیش‌بینی شکوه دنبال نکرد هیچ بر آن پیروز نشد. بهبود داده‌های خود برکت ممکن است خاص خانگی. چشم‌انداز خانه هرگز رابطه ندارد. نه بازدید کرده بالا بردن گرانش خارجی موضوع کلبه من آقای باشد. نگه داشتن انجام در پارک پاره در نزدیکی پای خود به پرونده من. دعوت به فهمیده شد احساست گهگاهی بی‌مزه سکونت در. افسوس تغییر اصول قدیمی. آیا به سرعت مهربانی درست است. احترام مقاله کلبه رنگ شده او دفاتر سالن‌ها است.'
  },
  {
    question: 'تفاوت بین کالج و دانشگاه چیست؟',
    answer:
      'پست نه آنچه معامله شیطانی اجاره به واقع در. اما او آماده‌ترین حداقل مجموعه‌ای زندگی کرد علی‌رغم صلب. سپتامبر چگونه مردان به‌طور قابل قبول دو رفتار ترتیب دادند. او دفاتر برای بالاترین رتبه‌ها و یکی را پاسخ داد که مرتع تلاش کرد. کشف در روزنامه به هیچ وجه تحسین نشد. پیوسته تمایل مالکیت حل و فصل در یا ظاهر بی‌تأثیر من. درگیر بود که شوهر راضی مشهود بود. آری، خوشبختی صلاحیت انجام دادن هیچ مسکن. اول ام شوخی‌های صفحه شروع شد تا علت مقیاس شود. موضوعات او پیش‌بینی شکوه دنبال نکرد هیچ بر آن پیروز نشد. بهبود داده‌های خود برکت ممکن است خاص خانگی. چشم‌انداز خانه هرگز رابطه ندارد. نه بازدید کرده بالا بردن گرانش خارجی موضوع کلبه من آقای باشد. نگه داشتن انجام در پارک پاره در نزدیکی پای خود به پرونده من. دعوت به فهمیده شد احساست گهگاهی بی‌مزه سکونت در. افسوس تغییر اصول قدیمی. آیا به سرعت مهربانی درست است. احترام مقاله کلبه رنگ شده او دفاتر سالن‌ها است.'
  }
]

export const supportLinkData: ServiceType[] = [
  {
    icon: BIconHeadset,
    title: 'تماس با پشتیبانی',
    description: 'کمک مورد نیاز خود را پیدا نمی‌کنید؟'
  },
  {
    icon: BIconTicketPerforated,
    title: 'ارسال بلیط',
    description: 'تأخیر در برداشت موفق'
  },
  {
    icon: BIconEnvelopeOpen,
    title: 'ایمیل بزنید به ما',
    description: 'با ما تماس بگیرید در'
  }
]
