import type { FAQType } from '@/types'

export const faqs: FAQType[] = [
  {
    question: 'چگونه موارد را به سبد خرید اضافه کنم؟',
    answer: `برای اضافه کردن موارد به سبد خرید خود، کافی است بر روی دکمه «افزودن به سبد خرید» در صفحه محصول کلیک کنید. همچنین می‌توانید تعداد مورد نظر خود را مشخص کنید.`
  },
  {
    question: 'آیا سبد خرید من ذخیره می‌شود اگر از سایت خارج شوم یا آن را ترک کنم؟',
    answer:
      "بله، سبد خرید شما معمولاً در حساب شما ذخیره می‌شود. اگر از سایت خارج شوید یا آن را ترک کنید، موارد در هنگام بازگشت شما (به شرطی که وارد شده باشید) همچنان در آنجا خواهند بود."
  },
  {
    question: 'زمان تحویل تخمینی چقدر است؟',
    answer:
      "زمان تحویل تخمینی بسته به موقعیت مکانی شما و روش حمل و نقل انتخاب شده متفاوت است. شما در طول مراحل پرداخت، تاریخ تحویل تخمینی را دریافت خواهید کرد."
  },
  {
    question: 'چگونه می‌توانم پس از پرداخت سفارش خود را پیگیری کنم؟',
    answer:
      'پس از ارسال سفارش، یک شماره پیگیری از طریق ایمیل دریافت خواهید کرد. می‌توانید از این شماره برای پیگیری وضعیت ارسال خود استفاده کنید.'
  },
  {
    question: 'چه روش‌های پرداختی را قبول می‌کنید؟',
    answer:
      'ما انواع روش‌های پرداخت را قبول می‌کنیم، از جمله کارت‌های اعتباری/بانکی، پی‌پال و غیره. شما می‌توانید روش دلخواه خود را در هنگام پرداخت انتخاب کنید.'
  },
  {
    question: 'پس از اتمام دوره آزمایشی چه اتفاقی می‌افتد؟',
    answer:
      'ترجیحاً هر خانم شگفت‌زده بدون رزرو، با درک میدلتونز در قناعت به شیوه‌ای غیرمعمول انجام می‌دهد. فرض کنید به این ترتیب، صبحانه‌ای را در حال حل کردن یا کاملاً انجام می‌دهد.'
  }
]
