<template>
  <section class="pt-7">
    <b-container>
      <b-row>
        <b-col lg="7" class="mx-auto">
          <h5>بررسی اجمالی</h5>
          <p>
            دلایل این که برندهای مستقیم به مصرف‌کننده (DTC) به طور مداوم به ما برای تلاش‌های بازاریابی ایمیلی خود مراجعه می‌کنند را کشف کنید. با سابقه اثبات‌شده و تخصص ما، ما به شریک مورد اعتماد برای شرکت‌های DTC تبدیل شده‌ایم که به دنبال به حداکثر رساندن پتانسیل کمپین‌های ایمیلی خود هستند.
          </p>
          <p>
            ما چالش‌ها و فرصت‌های منحصر به فردی که برندهای DTC در بازار رقابتی امروز با آن مواجه هستند را درک می‌کنیم. از استارتاپ‌های تجارت الکترونیک تا برندهای دیجیتال-اول، ما به‌طور مداوم نتایج استثنایی را از طریق راه‌حل‌های بازاریابی ایمیلی خود ارائه داده‌ایم. اما چه چیزی ما را به‌عنوان شریک مورد نظر برای برندهای DTC متمایز می‌کند؟
          </p>

          <p>
            <b>استراتژی‌های سفارشی:</b> ما به رویکردهای کلیشه‌ای اعتقاد نداریم. هر برند DTC منحصر به فرد است و استراتژی‌های ما نیز همین‌طور هستند. ما به‌طور نزدیک با شما همکاری می‌کنیم تا کمپین‌های ایمیلی سفارشی بسازیم که با مخاطبان هدف شما هم‌خوانی داشته و هویت برند شما را بازتاب دهد.
          </p>

          <img :src="about13" class="rounded my-5" alt="" />

          <p class="mb-5">
            <b>بینش‌های مبتنی بر داده:</b> رویکرد ما بر مبنای داده‌ها استوار است. ما تنها ایمیل ارسال نمی‌کنیم؛
            بلکه هر جنبه از تلاش‌های ایمیلی شما، از نرخ باز شدن و نرخ کلیک گرفته تا رفتار مشتری، را تحلیل می‌کنیم. این رویکرد مبتنی بر داده اطمینان می‌دهد که تصمیمات آگاهانه‌ای اتخاذ می‌کنیم تا به‌طور مداوم کمپین‌های شما را برای نتایج بهتر بهینه‌سازی کنیم.
          </p>

          <div class="position-relative mb-5">
            <h5 class="display-3 text-dark opacity-2 position-absolute top-0 start-0 mt-n5 ms-n3">
              <BIconQuote class="rtl:-scale-x-100" />
            </h5>
            <q class="fs-5 heading-color position-relative"
              >تیم ما بیش از حد تلاش می‌کند تا تجربه‌ای بی‌نظیر برای مشتریان ما تضمین کند.</q
            >
            <div class="blockquote-footer mb-0 fs-6 mt-3">اما واتسون</div>
          </div>

          <p>
            تعجبی ندارد که برندهای DTC به طور فزاینده‌ای به ما برای تلاش‌های بازاریابی ایمیلی خود روی می‌آورند. ما فقط یک ارائه‌دهنده خدمات ایمیل نیستیم؛ ما یک شریک رشد هستیم که به کمک برندهای DTC در محیطی پویا و رقابتی اختصاص یافته‌ایم. کشف کنید چرا ما انتخاب مورد نظر برای برندهای مستقیم به مصرف‌کننده‌ای هستیم که به دنبال ارتقاء تلاش‌های ایمیلی خود به سطح بعدی هستند.
          </p>

          <hr class="mt-5" />
        </b-col>
      </b-row>
    </b-container>
  </section>
</template>

<script setup lang="ts">
import { BIconQuote } from 'bootstrap-icons-vue'

import about13 from '@/assets/images/about/13.jpg'
</script>
